#### Step 1. Import the necessary libraries.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

#### Step 2. Create the DataFrame with the following values.

In [2]:
df = pd.DataFrame({'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]})

#### Step 3. Assign it to a variable called regiment.(Don't forget to name each column).

In [24]:
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

#### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [35]:
a = df['preTestScore'].groupby(df['regiment']).mean()
a

regiment
Dragoons      15.50
Nighthawks    15.25
Scouts         2.50
Name: preTestScore, dtype: float64

#### Step 5. Present general statistics by company.

In [47]:
df['preTestScore'].groupby(df['company']).describe()

         count       mean        std  min   25%   50%    75%   max
company
1st        6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd        6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

#### Step 6. What is the mean each company's preTestScore?.

In [56]:
df['preTestScore'].groupby(df['company']).mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

#### Step 7. Present the mean preTestScores grouped by regiment and company.

In [48]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

#### Step 8. Present the mean preTestScores grouped by regiment and company without hierarchical indexing.

In [53]:
# unstack() is used to reshape a pandas DataFrame by converting the row index to a column label.
df['preTestScore'].groupby([df['regiment'], df['company']]).mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

#### Step 9. Group the entire dataframe by regiment and company.

In [103]:
x = df.groupby(['regiment', 'company']).sum()
x

                              name  preTestScore  postTestScore
regiment   company
Dragoons   1st          CoozeJacon             7             95
           2nd          RyanerSone            55            151
Nighthawks 1st      MillerJacobson            28            119
           2nd           AliMilner            33            119
Scouts     1st          SloanPiger             5            132
           2nd            RianiAli             5            132

In [3]:
x = df.groupby(['regiment', 'company']).apply(lambda x: x.reset_index(drop=True))
x

                        regiment company      name  preTestScore  \
regiment   company
Dragoons   1st     0    Dragoons     1st     Cooze             3
                   1    Dragoons     1st     Jacon             4
           2nd     0    Dragoons     2nd    Ryaner            24
                   1    Dragoons     2nd      Sone            31
Nighthawks 1st     0  Nighthawks     1st    Miller             4
                   1  Nighthawks     1st  Jacobson            24
           2nd     0  Nighthawks     2nd       Ali            31
                   1  Nighthawks     2nd    Milner             2
Scouts     1st     0      Scouts     1st     Sloan             2
                   1      Scouts     1st     Piger             3
           2nd     0      Scouts     2nd     Riani             2
                   1      Scouts     2nd       Ali             3

                      postTestScore
regiment   company
Dragoons   1st     0             70
                   1             25
           2nd     0             94
                   1             57
Nighthawks 1st     0             25
                   1             94
           2nd     0             57
                   1             62
Scouts     1st     0             62
                   1             70
           2nd     0             62
                   1             70

#### Step 10. What is the number of observations in each regiment and company.

In [98]:
# The size() function in Python is used to return the number of elements in an object.
# it can be used on any object supports len() func
df.groupby(['regiment', 'company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

#### Step 11. Iterate over a group and print the name and the whole data from the regiment.

In [99]:
# Grouping the dataframe regiment,by regiment column
for name, group in regiment.groupby('regiment'):
    print(name) 
    # print regiment data aswell
    print(group)
    print('\n')

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62


Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70